app/views/lists/index.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 3]]
---
          <li class="list-group-item">
            <span class="badge"><%= list.tasks.count %></span>