app/views/lists/show.html.erb

SELECT  1 AS one FROM "tasks" WHERE "tasks"."list_id" = $1 LIMIT $2  [["list_id", 9], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 2]]
---
<div>
  <% unless @list.tasks.empty? %>