app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" IN (12, 13)
---
  def index
    @lists = List.find(current_browser_lists).last(5)

INSERT INTO "lists" ("title", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "jAJJAJAAJ"], ["slug", "jajjajaaj"], ["created_at", 2016-12-07 04:11:05 UTC], ["updated_at", 2016-12-07 04:11:05 UTC]]
---
  def create
    @list = List.new(list_params)

    if @list.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1 AND "tasks"."priority" = $2  [["list_id", 3], ["priority", "high"]]
---
  def show
    @task = Task.new
    @tasks_list = @list.tasks.where(priority: 'high') + @list.tasks.where(priority: 'medium') + @list.tasks.where(priority: 'low')

UPDATE "lists" SET "title" = $1, "slug" = $2, "updated_at" = $3 WHERE "lists"."id" = $4  [["title", "rrrr444"], ["slug", "rrrr444"], ["updated_at", 2016-12-07 04:36:24 UTC], ["id", 9]]
---
  def update
    @list.update list_params

SELECT  "lists".* FROM "lists" WHERE "lists"."slug" = $1 LIMIT $2  [["slug", "rrr"], ["LIMIT", 1]]
---
  def set_list
    @list = List.find_by(slug: params[:list_id] || params[:id])