app/controllers/tasks_controller.rb

    task = Task.new task_params
    task.state = 'in_progress'
    task.percentage = 0 if task.type == 'LongTask'
    task.list = @list

    if task.valid?
      task.save
---
INSERT INTO "tasks" ("type", "description", "priority", "percentage", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["type", "LongTask"], ["description", "qwrrwqrqwqrwr"], ["priority", "low"], ["percentage", 0], ["list_id", 3], ["created_at", 2016-12-09 13:41:55 UTC], ["updated_at", 2016-12-09 13:41:55 UTC]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "priority" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["priority", "medium"], ["updated_at", 2016-12-09 15:55:15 UTC], ["id", 7]]

  def set_list
    @list = List.find_by(slug: params[:list_id] || params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."slug" = $1 LIMIT $2  [["slug", "listorti"], ["LIMIT", 1]]